{
  "environment": "web",
  "format": "html",
  "prefix": "https://storage.googleapis.com",
  "mainga": "UA-49880327-14",
  "updated": "2023-10-22T17:10:40-03:00",
  "id": "tutorial-acessibilidade-webmedia2023",
  "duration": 78,
  "title": "Como testar a acessibilidade em soluções mobile (WebMedia 2023)",
  "authors": "Anderson Canale Garcia e Kamila Rios da Hora Rodrigues",
  "summary": "Atualmente, aplicativos Android nativos ainda apresentam barreiras que dificultam a interação dos usuários com deficiência, o que ressalta a necessidade contínua de melhorar a acessibilidade desses aplicativos. Existem instrumentos disponíveis, como guias, recomendações e ferramentas de testes, para auxiliar os desenvolvedores a eliminarem essas barreiras em seus aplicativos. No entanto, observa-se que, apesar da disponibilidade dessas soluções, muitos aplicativos continuam apresentando problemas recorrentes, o que indica que essas ferramentas podem não estar sendo adequadamente aplicadas. Pesquisas têm buscado entender por que designers e desenvolvedores não implementam produtos acessíveis. De modo geral, estes estudos indicam que os desenvolvedores têm apresentado alguma consciência sobre a importância da acessibilidade, porém o conhecimento sobre o tema é superficial, faltam orientações práticas, requisitos de acessibilidade não são bem especificados, as responsabilidades não são bem definidas e a acessibilidade não é priorizada pelas partes interessadas. Entre as possíveis soluções, apontadas nos estudos para esses problemas, destacam-se: oferecer cursos e treinamentos para ampliar o conhecimento dos desenvolvedores sobre como resolver os problemas de acessibilidade e utilizar suítes de testes apropriadas, que sejam simples e fáceis de serem usadas, por exemplo, incluindo testes automatizados. Este tutorial visa abordar esses desafios e capacitar profissionais de desenvolvimento, design e teste para enfrentar as complexidades da acessibilidade em soluções mobile. Com foco em aplicativos Android nativos, exploraremos abordagens e ferramentas para testar e melhorar a acessibilidade. Ao final do tutorial, os participantes estarão equipados para criar aplicativos com acessibilidade.",
  "source": "TutorialWebmedia2023.md",
  "theme": "",
  "status": null,
  "category": [
    "android",
    "accessibility"
  ],
  "tags": [
    "acessibilidade",
    "android",
    "testes"
  ],
  "url": "tutorial-acessibilidade-webmedia2023"
}
